tap "bufbuild/buf"
tap "clicksandmortar/launchpad"
tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "garden-io/garden"
tap "goreleaser/tap"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "pact-foundation/pact-ruby-standalone"
tap "pulumi/tap"
tap "romkatv/powerlevel10k"
tap "stripe/stripe-cli"
tap "tabbyml/tabby"
# Run your GitHub Actions locally
brew "act"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Text processing system for reStructuredText
brew "docutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Fish completion for brew-cask
brew "brew-cask-completion"
# New way to see and navigate directory trees
brew "broot"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# CLI tool for running SQL queries against JSON, CSV, Excel, Parquet, and more
brew "dsq"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Platform built on V8 to build network applications
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Update multiple git repositories at once
brew "gitup"
# Render markdown on the CLI
brew "glow"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GUI toolkit
brew "gtk+"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# LastPass command-line interface tool
brew "lastpass-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Cryptographic recipes and primitives for Python
brew "python-cryptography"
# Fully functional local AWS cloud stack
brew "localstack"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Mock code autogenerator for Golang
brew "mockery"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Display the PID number for a given process name
brew "pidof"
# Generic machine emulator and virtualizer
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Protocol buffers library
brew "protobuf-c"
# Protocol buffers (Google's data interchange format)
brew "protobuf@3"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Your Swiss Army Knife for Protocol Buffers
brew "prototool"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Persistent key-value database, with built-in net interface
brew "redis"
# Fast, efficient and secure backup program
brew "restic"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Editor of encrypted files
brew "sops"
# Generate type safe Go from SQL
brew "sqlc"
# Cross-shell prompt for astronauts
brew "starship"
# Open source continuous file synchronization application
brew "syncthing"
# Tool Command Language
brew "tcl-tk"
# Tool to build, change, and version infrastructure
brew "terraform"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Undo git commands. Your damage control git buddy
brew "ugit"
# Vi 'workalike' with many additional features
brew "vim"
# WebSockets the Unix way
brew "websocketd"
# Personal information dashboard for your terminal
brew "wtfutil"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Software to be used as a service scaffolding tool for Clicks & Mortar engineers
brew "clicksandmortar/launchpad/launchpad"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Development engine for Kubernetes
brew "garden-io/garden/garden-cli"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Standalone pact CLI executable using the Ruby Pact impl and Travelling Ruby
brew "pact-foundation/pact-ruby-standalone/pact-ruby-standalone"
# Tabby: AI Coding Assitatnt
brew "tabbyml/tabby/tabby"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Clipboard manager for developers
cask "flycut"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Hex editor focussing on speed
cask "hex-fiend"
# Access the HEY email service
cask "hey"
# Utility to hide menu bar items
cask "hiddenbar"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customizer
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Free and Open Source messaging and emailing app
cask "rambox"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# System monitor for the menu bar
cask "stats"
# Editor for designing and documenting APIs
cask "stoplight-studio"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Unpacks archive files
cask "the-unarchiver"
# To-do list
cask "todoist"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "ardenivanov.svelte-intellisense"
vscode "bmewburn.vscode-intelephense-client"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "Codium.codium"
vscode "DavidAnson.vscode-markdownlint"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "firsttris.vscode-jest-runner"
vscode "fivethree.vscode-svelte-snippets"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go-nightly"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "qinjia.seti-icons"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "svelte.svelte-vscode"
vscode "TabbyML.vscode-tabby"
vscode "wayou.vscode-todo-highlight"
vscode "windmilleng.vscode-go-autotest"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
