tap "0north/zntacs"
tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "clicksandmortar/launchpad"
tap "cloudflare/cloudflare"
tap "codecrafters-io/tap"
tap "derailed/k9s"
tap "dlvhdr/formulae"
tap "garden-io/garden"
tap "garethgeorge/backrest-tap"
tap "goreleaser/tap"
tap "grishka/grishka"
tap "gromgit/brewtils"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hougesen/tap"
tap "nao1215/tap"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "pact-foundation/pact-ruby-standalone"
tap "pulumi/tap"
tap "qmk/qmk"
tap "romkatv/powerlevel10k"
tap "siderolabs/tap"
tap "stripe/stripe-cli"
tap "tabbyml/tabby"
tap "xo/xo"
# Run your GitHub Actions locally
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# AI pair programming in your terminal
brew "aider"
# New file format for still image compression
brew "jpeg-xl"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Fast, efficient and secure backup program
brew "restic"
# High level CLI utility for restic
brew "autorestic"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Language Server for Bash
brew "bash-language-server"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Python code formatter
brew "black"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Fish completion for brew-cask
brew "brew-cask-completion"
# New way of working with Protocol Buffers
brew "buf"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Utility for rendering projects templates
brew "copier"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# High performance csv viewer for cli
brew "csview"
# Command-line csv viewer
brew "csvlens"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Isolated development environments using Docker
brew "docker-compose"
# Language server for Dockerfiles powered by Node, TypeScript, and VSCode
brew "dockerfile-language-server"
# Text processing system for reStructuredText
brew "docutils"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# CLI tool for running SQL queries against JSON, CSV, Excel, Parquet, and more
brew "dsq"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Update multiple git repositories at once
brew "gitup"
# Render markdown on the CLI
brew "glow"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Stricter gofmt
brew "gofumpt"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for `golangci-lint`
brew "golangci-lint-langserver"
# Language server for the Go language
brew "gopls"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Ping, but with a graph
brew "gping"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GUI toolkit
brew "gtk+"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# LastPass command-line interface tool
brew "lastpass-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# High-performance, extensible alternative to ls
brew "lla"
# Fully functional local AWS cloud stack
brew "localstack"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Mock code autogenerator for Golang
brew "mockery"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Display the PID number for a given process name
brew "pidof"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Open source backend for your next project in 1 file
brew "pocketbase"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Protocol buffers library
brew "protobuf-c"
# Protocol buffers (Google's data interchange format)
brew "protobuf@3"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Messaging and streaming broker
brew "rabbitmq"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Interactive find and replace in the terminal
brew "scooter"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Editor of encrypted files
brew "sops"
# Generate type safe Go from SQL
brew "sqlc"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Fast SQL formatter/linter
brew "sqruff"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Open source continuous file synchronization application
brew "syncthing", link: false
# Tool Command Language
brew "tcl-tk"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform Language Server
brew "terraform-ls"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Program that allows you to count code, quickly
brew "tokei"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Undo git commands. Your damage control git buddy
brew "ugit"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Executes a program periodically, showing output fullscreen
brew "watch"
# WebSockets the Unix way
brew "websocketd"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Why is this running?
brew "witr"
# Personal information dashboard for your terminal
brew "wtfutil"
# Language Server for Yaml Files
brew "yaml-language-server"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Git diff pager based on delta but with a file tree, à la GitHub
brew "dlvhdr/formulae/diffnav"
# Development engine for Kubernetes
brew "garden-io/garden/garden-cli"
# Backrest is a web UI and orchestrator for restic backup.
brew "garethgeorge/backrest-tap/backrest"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# A code formatter for kdl documents.
brew "hougesen/tap/kdlfmt"
# NATS utility
brew "nats-io/nats-tools/nats"
# Standalone pact CLI executable using the Ruby Pact impl and Traveling Ruby
brew "pact-foundation/pact-ruby-standalone/pact-legacy"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby"
# universal command-line SQL client interface
brew "xo/xo/usql"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Clipboard manager for developers
cask "flycut"
# Unofficial native application for Fastmail
cask "fmail3"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@canary"
# Release engineering, simplified
cask "goreleaser/tap/goreleaser"
# Hex editor focussing on speed
cask "hex-fiend"
# Dedicated scratchpad for developers
cask "heynote"
# Utility to hide menu bar items
cask "hiddenbar"
# Open source API development ecosystem
cask "hoppscotch"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualiser
cask "keycastr"
# ZSA keyboard firmware flasher
cask "keymapp"
# Kubernetes IDE
cask "lens"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# OpenVPN client
cask "pritunl"
# VPN client focusing on security
cask "protonvpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Workspace simplifier - to organize your workspace and boost your productivity
cask "rambox"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# System monitor for the menu bar
cask "stats"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Real time file synchronisation software
cask "syncthing-app"
# Unpacks archive files
cask "the-unarchiver"
# To-do list
cask "todoist-app"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Software to be used as a general purpose and service scaffolding tool for ZeroNorth engineers
cask "0north/zntacs/zntacs"

mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/766b/go-outliner"
go "goa.design/goa/v3/cmd/goa"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/josharian/impl"
go "github.com/ogen-go/ogen/cmd/ogen"
go "github.com/timtatt/sift"
go "github.com/sqls-server/sqls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
cargo "helix-driver"
cargo "simple-completion-language-server"
