tap "bufbuild/buf"
tap "clicksandmortar/launchpad"
tap "cloudflare/cloudflare"
tap "codecrafters-io/tap"
tap "derailed/k9s"
tap "garden-io/garden"
tap "garethgeorge/backrest-tap"
tap "goreleaser/tap"
tap "grishka/grishka"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nao1215/tap"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "pact-foundation/pact-ruby-standalone"
tap "pulumi/tap"
tap "qmk/qmk"
tap "romkatv/powerlevel10k"
tap "siderolabs/tap"
tap "stripe/stripe-cli"
tap "tabbyml/tabby"
# Run your GitHub Actions locally
brew "act"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Platform built on V8 to build network applications
brew "node"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Fish completion for brew-cask
brew "brew-cask-completion"
# New way of working with Protocol Buffers
brew "buf"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Next-gen compiler infrastructure
brew "llvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# CLI tool for running SQL queries against JSON, CSV, Excel, Parquet, and more
brew "dsq"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Framework for layout and rendering of i18n text
brew "pango"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Update multiple git repositories at once
brew "gitup"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Ping, but with a graph
brew "gping"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GUI toolkit
brew "gtk+"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# LastPass command-line interface tool
brew "lastpass-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# General purpose TCP-IP emulator
brew "libslirp"
# High-performance, extensible alternative to ls
brew "lla"
# Fully functional local AWS cloud stack
brew "localstack"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Mock code autogenerator for Golang
brew "mockery"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Display the PID number for a given process name
brew "pidof"
# Open source backend for your next project in 1 file
brew "pocketbase"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Protocol buffers library
brew "protobuf-c"
# Protocol buffers (Google's data interchange format)
brew "protobuf@3"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Editor of encrypted files
brew "sops"
# Generate type safe Go from SQL
brew "sqlc"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Open source continuous file synchronization application
brew "syncthing"
# Tool Command Language
brew "tcl-tk"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform Language Server
brew "terraform-ls"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Program that allows you to count code, quickly
brew "tokei"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Undo git commands. Your damage control git buddy
brew "ugit"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# WebSockets the Unix way
brew "websocketd"
# Personal information dashboard for your terminal
brew "wtfutil"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Development engine for Kubernetes
brew "garden-io/garden/garden-cli"
# Backrest is a web UI and orchestrator for restic backup.
brew "garethgeorge/backrest-tap/backrest"
# Release engineering, simplified
brew "goreleaser/tap/goreleaser"
# Standalone pact CLI executable using the Ruby Pact impl and Travelling Ruby
brew "pact-foundation/pact-ruby-standalone/pact-ruby-standalone"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Clipboard manager for developers
cask "flycut"
# Unofficial native application for Fastmail
cask "fmail2"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@canary"
# Hex editor focussing on speed
cask "hex-fiend"
# Dedicated scratchpad for developers
cask "heynote"
# Utility to hide menu bar items
cask "hiddenbar"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualiser
cask "keycastr"
# Kubernetes IDE
cask "lens"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Free and Open Source messaging and emailing app
cask "rambox"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# System monitor for the menu bar
cask "stats"
# Real time file synchronisation software
cask "syncthing"
# Unpacks archive files
cask "the-unarchiver"
# To-do list
cask "todoist"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "4ops.terraform"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "azemoh.one-monokai"
vscode "bmewburn.vscode-intelephense-client"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "jasew.vscode-helix-emulation"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pbkit.vscode-pbkit"
vscode "qinjia.seti-icons"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "silverquark.dancehelix"
vscode "vintharas.learn-vim"
vscode "wayou.vscode-todo-highlight"
vscode "windmilleng.vscode-go-autotest"
vscode "zxh404.vscode-proto3"
